[{"text": "The Metropolitan Police Department released photos Tuesday of two men investigators are trying to question about a shooting at a Northeast D.C. nightclub that injured five people.\n\nThe shooting happened as the club, D.C. Soundstage, was closing in the early morning hours Saturday. One man was involved in an altercation with a patron as the club closed, left the club, then re-entered and began firing inside, Metropolitan Police Department spokesman Officer Hugh Carew said. One woman and four men were shot, but all five were expected to survive.\n\nPolice described the shooter as a 20- to 25-year-old black man, about 6 feet tall, with shoulder-length dreadlocks and a full beard who possibly wore all black clothing. He is not one of the men shown in the photos police released Tuesday, Officer Carew said.\n\nThe two “persons of interest” whose photos were released are described by police as a black man wearing no shirt, blue jeans and a dark skull cap, and a second black man wearing a black top and with his braided hair pinned up.\n\nPolice Chief Cathy L. Lanier ordered D.C. Soundstage closed through Wednesday after the shooting. The District’s Alcoholic Beverage Control Board will review a report on the incident at their Wednesday meeting and could make further recommendations.\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "publish_date": "2013-01-29"}, {"text": "Published on Mar 14, 2013\n\nThis evening at around 8:00 p.m. officers from the Modesto Police Department along with Emergency Crews were dispatched to Western Way near Sutter Ave. in Modesto, California for reports of a Drive-By Shooting with multiple gunshot victims.\n\n\n\nWhen police arrived they found a total of 4 adult victims, 3 men and 1 woman. All 4 were transported to area hospitals. The woman and 2 of the men are said to have non-life-threatening injuries while the 3rd man is said to be in critical condition.\n\n\n\nPolice have not yet released any suspect information in these early hours of the investigation. They remained on scene for several hours interviewing witnesses and collecting evidence.\n\n\n\nWe will update you when and if the Modesto Police department releases additional information in this case.\n\n\n\nModesto News .org was there on the scene in order to bring you this footage of the crime scene, an interview with two witnesses, and this written account of what happened.\n\n\n\nhttp://www.ModestoNews.org\n\n\n\nAll Rights Reserved - Copyright 2013\n\n\n\nTags:\n\n\n\ndrive-by shooting shot injured west side Modesto California police department shoot homicide investigation \"drive by shooting\" \"drive by\" \"shooting in Modesto\" \"Modesto shooting\" \"Modesto Police Department\" \"Modesto News\" \"police investigation\" \"west side\" \"west side Modesto\" \"Modesto west side\" gang gangs \"gang shooting\" \"Modesto gang\" \"gang in Modesto\" \"Modesto gangs\" news information report interview story \"news story\"", "publish_date": ""}, {"text": "DETROIT (WWJ) — A visitation service was held tonight for Detroit teenager and Western Michigan University student Damond Carpenter, who was murdered one week ago in a drive-by shooting.\n\nA steady flow of mourners filed into the Cole Funeral Home on West Grand Boulevard Friday night to pay their respects to the family of 18-year-old Damond Carpenter, who was gunned down as he drove by an apartment building on Cadieux and Morang on Dec. 22.\n\n“Damond was just a great kid,” said Melinda Carpenter, mother of Damond. “Always happy and was always there.”\n\nPolice do not believe Damond Carpenter was the intended target of the shooting, which also left two other people injured. Investigators have not yet discovered a motive for the shooting.\n\nMelinda Carpenter said she is trying to find forgiveness for those who killed her son.\n\n“I’m a Christian so therefore I can try to forgive them but I will never forget what they did,” Melinda Carpenter said. “They took my baby from me and I hate them for that. I will get justice for my baby until the day I die.”\n\nA GoFundMe account to help the family has been created and has already raised more than $5,000.\n\nDetroit Police continue to search for those responsible in the shooting of Damond Carpenter, who will be laid to rest on Saturday. Descriptions of the suspect have not been released, but reports indicate the shots were fired from a Chrysler 300.\n\nCarpenter’s family and friends are asking for the public’s help in identifying any suspects in the shooting. Anyone with information is asked to contact police at 313-267-4600. Tips can also be submitted anonymously to Crime Stoppers at 1-800-SPEAK-UP.", "publish_date": ""}, {"text": "April 22, 2013 at 7:40 AM\n\nTED S. WARREN\n\nThe Associated Press\n\nGunfire erupted at a Federal Way apartment complex Sunday night where five people were shot to death, including a suspect who was shot by arriving officers, police said.\n\nOfficers responding to an emergency call at 9:30 p.m. at the Pine Village Apartments encountered a chaotic scene, with bullets flying.\n\n“When officers arrived there were still shots being fired,” said Federal Way police spokeswoman Cathy Schrock.\n\nThey found two wounded men on the ground in a parking lot. One of the men reached for a gun as police moved in to assist the two, she said.\n\nAt that point, officers opened fire. The suspect died but police said it wasn’t immediately clear if it was from their gunfire.\n\nThe other man on the ground and a third man in the parking lot were found dead.\n\nIn a search of the complex, police found a fourth man dead in one apartment and a slain woman in another unit. Schrock said police were trying to determine if the woman was hit by a stray bullet.\n\nA total of eight officers fired their weapons, Schrock said. All have been placed on administrative leave, per standard policy, as the investigation continues.\n\nThere was no immediate word what set off the shooting. Police scheduled a briefing for late Monday morning.\n\n“We still don’t have any idea what started this disturbance tonight,” Schrock said.\n\nAfter police flooded the area and carried out searches, authorities said they were confident there were no more casualties from the shooting.\n\nThey said they did not think another shooter was on the loose or that there was an immediate threat to the public.\n\nThere were no reports of any officers being injured. The names of the five people killed were not immediately available.\n\nOfficers were using a metal detector to search a grassy bank across the street from the apartment complex this morning.\n\nKristina Braun, 23, said she, her husband and 3-year-old daughter went to the movies and dinner yesterday, arriving about home 9:30 p.m.\n\n“We saw and heard a ton of ambulances and police cars everywhere,” she said this morning.\n\nHer family was still not allowed to return to their apartment this morning, awaiting police to give the OK.\n\n“It’s actually really calm, normally … This is the first huge issue,” said Braun, who’s lived in the complex for two years. She said about 6 months ago, a lot of police showed up for the robbery at a nearly grocery.\n\nSung Yang, who runs a motel nearby, said he and residents heard the gunfire.\n\n“I heard gunshots. Lot of gunshots. It was scary,” Yang said.\n\nThere was a series of shots at first and then after about 10 minutes, more shooting, he said.\n\n“Everybody staying here came out to see what it was,” but they got little information.\n\n“I’ve lived here five and a half or six years and I’ve never had a problem. I just don’t understand it.” said Kelly Burki, a resident of the complex.\n\nBurki, 51, was out for the evening and was returning home about 11 p.m. to find her street closed by police. She said she was told she could return home in a couple of hours, but at 8 a.m today, police still had the street closed.\n\nBurki said she is a bartender who frequently doesn’t get home until around 2:30 a.m. “But even at that hour, I’ve always felt safe. I’ve never fear.”\n\nSeattle Times staff reporter Jack Broom contributed to this report.", "publish_date": "2013-04-05"}, {"text": "Samuel Sallee has denied killing the four people, whom he said were his friends.>", "publish_date": "2015-02-25"}, {"text": "Fatal Shootings in Herkimer March 13, 2013\n\nView the Slideshow >>\n\n(Gallery by The Associated Press)\n\nUpdate 8:27 a.m. Thursday: Authorities say they have shot and killed Herkimer murder suspect Kurt Myers, 64, wanted in the shooting deaths of four people Wednesday.\n\nEarlier:\n\nHerkimer, NY -- It's Day Two of the standoff between police and a Herkimer County man wanted in the shooting deaths of four people Wednesday.\n\nThe Post-Standard and Syracuse.com are sending reporters and a photographer to the scene this morning. Please use the menu to the right to see our latest coverage or read our entire coverage.\n\nHere's a quick look at what you need to know about the case:\n\nKurt Myers\n\n1. Suspect Kurt Myers, of Mohawk, is believed to be hunkered down in a vacant building in downtown Herkimer after shooting at police early Wednesday afternoon.\n\n2. Herkimer and Mohawk schools are closed today and Herkimer County Community College classes are delayed to 10 a.m. due to the standoff, The Utica Observer-Dispatch reported as of 6:30 a.m.\n\n3. State police have identified the victims as:\n\nHarry Montgomery, 68, of 3 S. Washington St., Mohawk and retired corrections officer Michael Ransear, of 114 Delrose Lane, Herkimer. Both customers at a village of Mohawk barber shop were pronounced dead at the scene.\n\nTwo others were critically wounded at the barbershop: John Seymour, 66, owner of the barber shop, and Daniel A. Haslauer, 67, customer at the barber shop. Both were listed in critical condition Wednesday at St. Elizabeth's Hospital in Utica.\n\nKilled at a car care business in the village of Herkimer were Thomas Stefka, an employee, and Michael L. Renshaw, a customer and 23-year corrections officer.\n\n4. Suspected gunman Myers was described as a loner who rarely talked to neighbors. A victim's family told The Associated Press that he fired at victims without warning.\n\n5. Authorities believe Myers set his apartment house on fire shortly before 9:30 a.m. Wednesday morning, then went to the barbershop where he opened fire. Afterwards, he went to the car care center before bringing downtown Herkimer to a standstill by holing up in the abandoned building Wednesday afternoon.\n\n6. Myers is believed to have fired at officers from inside the abandoned building. That's the last contact authorities had with him.\n\n7. Gov. Andrew Cuomo and state police Superintendent Joseph D'Amico spoke to media at 5 p.m. Wednesday in the first few hours of the standoff. Cuomo said it was too early to tell if stricter gun laws, which he has championed, could have prevented Wednesday's mayhem. The governor said the \"day is not done\" until Myers is apprehended.\n\nThe Utica Observer-Dispatch created this map with the locations of events throughout the day:", "publish_date": "2013-03-14"}, {"text": "Screen Shot 2013-04-08 at 8.28.52 PM.png\n\nNew Orleans police released video of a suspect in a Mardi Gras weekend shooting on Bourbon Street.\n\n(NOPD)\n\nNew Orleans police are seeking a fourth suspect in a\n\nduring the weekend leading up to Mardi Gras.\n\nFour people were wounded in the Feb. 9 incident when gunfire erupted in the\n\nafter an argument involving three men. The intended victim was shot in the stomach, and three bystanders were injured.\n\nSince then, police have made three arrests in the case: 22-year-old\n\n, 23-year-old\n\nand 19-year-old\n\n.\n\nOn Monday night, police released a video of the latest suspect, who has yet to be identified. Detectives believe the man may go by the name \"Brandon,\" \"B-Money,\" or \"B.\" He is believed to live on the West Bank in Westwego or Harvey, and drive a 2006 four-door silver or gray Chevrolet Impala.\n\nCrimestoppers is offering up to a $2,500 reward for information leading to the arrest and indictment of the person or persons responsible for this crime. Citizens with information regarding this crime are asked to call Crime stoppers at 822.1111 or toll free at 1.877.903.STOP (7867).", "publish_date": "2013-04-09"}, {"text": "The mystery continues about what led to the shootings of four people on the Indianapolis east side Tuesday night. One of those people died.\n\nIt happened at around 8:00 pm at Wellington Village Apartments. The complex is in the 1800 block of Edinburge Square, which is near East 16th Street and I-465.\n\nNow, we have new insight into who the victims are and how they knew each other.\n\nThe crime scene was chaotic as 25-year-old Michael Baker lay dead in the entry to this apartment building.\n\n\"I heard the gun sounds and thought 'no, not in Wellington Village,'\" said Kyana Waller, an apartment resident.\n\nBut, fifteen hours later, Wellington Village is quiet, with no major signs anything ever happened here. But if you talk to the victim's family, this crime is still fresh and the impact will be long-lasting.\n\n\"Whoever shot them, when they catch them, they need to electrocute him because that was attempted murder,\" said the father of one of the victims.\n\nThe man wouldn't give us his name, but didn't mind sharing his rage about the person or persons who shot his son, Christian Smith. The 19-year-old survived, but with multiple gunshot wounds.\n\n\"If you want to shoot at people, go to the Army and shoot at people that will shoot back. But you're so sorry and scared you want to shoot at people that ain't bothered you,\" the man said.\n\nAccording to witnesses, Michael Baker was leaning up against the door talking with the three nineteen-year-olds when someone started firing from outside. Up to six bullets went through the door, hitting everyone inside and killing Michael.\n\nDiana Shell is the grandmother of another victim. Dejour Martin is also 19. He was treated at the scene last night and tried to help police.\n\n\"He was shot in the hand and the bullet went in here and came out there,\" said Shell. \"He says all he knows is they heard shots and he was trying to get out of the way and get his friend out of the way.\"\n\nMichael Baker's brother told us the 25-year-old was the father of two young children, ages three and five. He also said he worked at CVS Pharmacy and all he did was go to work and go home.\n\n\"I never knew him to have any enemies. He just got off work and his mom said he changed clothes and went to hang with his friends,\" Waller said.\n\nAnyone with information should call Crime Stoppers at 262-TIPS or IMPD at 317-327-3475. Callers can also text \"INDYCS\" plus tip information to 274627(CRIMES).", "publish_date": "2013-03-05"}, {"text": "Torri Stewart, 19, was shot and killed in the Bronzeville neighborhood Monday night, authorities said. Four other teens were wounded in a shooting in the city's Austin neighborhood Monday. View Full Caption Shutterstock\n\nCHICAGO — One teenager was killed, and four other teens were wounded in two separate shootings on the South and West sides Monday night, authorities said.\n\nA 19-year-old died hours after being shot in the head in Bronzeville.\n\nAbout 8:20 p.m. Monday, the teen was driving a car southbound in the 3100 block of South Rhodes Avenue when he was shot, police said.\n\nThe teen was taken to Northwestern Memorial Hospital in critical condition and was pronounced dead just after 11:40 p.m. He was identified as Torri Stewart, of the 900 block of East 81st Street, according to the Cook County Medical Examiner's Office.\n\nAt 9:30 p.m., four people were wounded in a shooting in the Austin neighborhood after a fight broke out between a large group of teens.\n\nDuring the fight, a light colored sedan pulled up and someone opened fire, according to Officer Ron Gaines, a police spokesman.\n\nA 19-year-old woman was hit in the right knee, and a 17-year-old woman was struck in the right thigh. Both were taken to Mount Sinai Hospital. An 18-year-old woman suffered a graze wound on her upper right arm, and a 14-year-old boy's abdomen was grazed by a bullet. Both were taken to Loretto Hospital. The four teens' conditions have stabilized.\n\nGaines said police believe the shooting was gang-related.\n\nNo one was in custody in either shooting as of Tuesday morning.", "publish_date": "2013-05-21"}, {"text": "A 19-year-old man was fatally shot in the South Side's Lake Meadows neighborhood in one of three shootings Monday night on the South and West Sides, officials said.\n\nTorri Stewart, of the 900 block of East 81st Street, was shot in the head about 8:20 p.m. as he sat in a vehicle in the 3100 block of South Rhodes Avenue, authorities said.\n\nHe was taken to Northwestern Memorial Hospital, where he was pronounced dead at 11:41 p.m., according to the Cook County medical examiner's office.\n\nLater, about 9:30 p.m., four teenagers were shot in 5200 block of West Iowa Street, in the West Side's South Austin neighborhood.\n\nThe teens had been part of a large group involved in a fight on the street when a light-colored car pulled up and at least one person inside opened fired, Chicago Police Department News Affairs Officer Ron Gaines said.\n\nTwo of the injured, a 14-year-old boy with a graze wound and an 18-year-old woman shot in the arm, were taken to Loretto Hospital. A 19-year-old woman shot in the knee and a 17-year-old girl shot in the leg were both taken to Mount Sinai Hospital.\n\nThe conditions of all four teens were stabilized, Gaines said.\n\nAlso on the West Side, a 34-year old man was grazed in the shoulder in the 300 block of South Western Avenue, Gaines said. The shooting happened about 10:30 p.m. in the Near West Side neighborhood.\n\nThe bullet did not penetrate the man's skin, and he was treated and released from John H. Stroger, Jr. Hospital of Cook County.\n\nNo suspects are in custody in the three shootings as detectives investigate.\n\nchicagobreaking@tribune.com\n\nTwitter: @ChicagoBreaking", "publish_date": "2013-05-20"}, {"text": "Four people were wounded in a shooting in Winton Hills.Officers responded to two scenes, one victim was located on Craft Street, another at a market on Kings Run Road, just after 1:30 p.m.An incident report states one man was shot in the face and was found in the Jacob's Market on Kings Run Road. The other victim was found in an apartment on Craft.While officers were responding to the scenes, two other gunshot victims walked into the emergency room at UC Medical Center. These two were also shot at the market, police said.Police said the four were shot inside the market by another man during a fight.“It's something the community doesn't want to happen. We don't want it to happen. People have to step up and be held accountable for this. We can't have people settling a dispute with guns in the middle of the street. It's not going to fly here,” police Capt. Paul Humphries said.There is no word yet on names or conditions, though police said all the victims are expected to recover.\n\nFour people were wounded in a shooting in Winton Hills.\n\nOfficers responded to two scenes, one victim was located on Craft Street, another at a market on Kings Run Road, just after 1:30 p.m.\n\nAdvertisement\n\nAn incident report states one man was shot in the face and was found in the Jacob's Market on Kings Run Road. The other victim was found in an apartment on Craft.\n\nWhile officers were responding to the scenes, two other gunshot victims walked into the emergency room at UC Medical Center. These two were also shot at the market, police said.\n\nPolice said the four were shot inside the market by another man during a fight.\n\n“It's something the community doesn't want to happen. We don't want it to happen. People have to step up and be held accountable for this. We can't have people settling a dispute with guns in the middle of the street. It's not going to fly here,” police Capt. Paul Humphries said.\n\nThere is no word yet on names or conditions, though police said all the victims are expected to recover.\n\nAlertMe", "publish_date": "2013-05-13"}, {"text": "", "publish_date": "2013-11-08"}, {"text": "A Camden County man facing numerous charges in connection with an altercation with a Delanco police officer in 2013 during which both were shot was found not guilty by reason of insanity.\n\nEugene Taylor, 26, of Clementon, appeared before Superior Court Judge Charles Delehey on Thursday at the Burlington County Courthouse in Mount Holly for a bench trial so the judge could determine his competence when the incident occurred.\n\nAccording to comments in court, Delanco police officer Francisco Ambrifi responded to a 911 call about 3:45 a.m. on May 14, 2013, reporting a man who was possibly under the influence screaming in the area of Delaware Avenue.\n\nTaylor allegedly appeared \"zoned out\" and in a \"religiously-disoriented state\" and made comments that \"you're going to see Jesus tonight,\" Delehey read from accounts of the incident. The judge noted that he was not making any finding of fact, but rather simply summarizing what was alleged to have happened.\n\nAfter the officer sprayed Taylor with mace there was a scuffle and Taylor was shot four times and the officer once in the leg with his own weapon. Court documents indicated that Taylor was alleged to have jumped in front of Ambrifi's patrol car.\n\nIn 2015, Taylor filed a civil lawsuit against Ambrifi, the municipality and others in U.S. District Court in Camden that is still pending, according to court records. In the suit, Taylor alleged that Ambrifi was not properly trained and had used excessive force against him during the altercation.\n\nTaylor, who has been in jail since June 2013, had lost an appeal in July to have the indictment dismissed because the grand jury did not consider his mental issues. A psychological evaluation determined that Taylor is schizophrenic and family and friends said he became obsessed with religion and even death in the days before the incident, according to court documents.\n\nA trial date had been set for January, but Taylor opted instead for the bench trial. Before Delehey ruled that Taylor was not guilty because he was mentally incapacitated during the incident, did not understand the nature of his conduct, and could not determine right from wrong, the state and defense agreed to certain conditions.\n\nBurlington County Assistant Prosecutor Thaddeus Drummond said the state agreed to dismiss all counts of the indictment, including attempted murder and aggravated assault, except for a third-degree offense of resisting arrest. That was the only offense considered by the judge during the trial.\n\nAlso, both sides agreed that Taylor will be sent to a psychiatric facility under what is known as Krol status until June 2018 and will waive his right for two years after that to challenge any finding by mental health professionals that he continue to be committed if he is deemed a risk to himself or others.\n\nThose on Krol status are evaluated annually by a judge to determine if they are a danger to themselves or society and should remain committed.", "publish_date": "2017-12-14"}, {"text": "You are the owner of this article.", "publish_date": ""}, {"text": "Pictured: The two male victims of OC student, 20, who gunned down a woman in his family home before stealing five cars to go on a bloody 25-minute murder spree\n\nSuspect identified as 20-year-old Ali Syed, an unemployed college student\n\n\n\nFirst victim was unidentified woman in her 20s at his parents' home in Ladera Ranch\n\nOther victims identified as construction worker Jeremy Lewis, 26, and business owner Melvin Lee Edwards, 69\n\n\n\nPolice report at least five crime scenes of dead or injured victims\n\nSyed was also shooting at passing cars on the freeway\n\n\n\nGunman followed by cops as he drove to middle of an intersection, where he got out of his car and shot himself\n\n\n\nMurderer: Ali Syed killed three people and himself in the bloody shooting spree in California\n\nThe two male victims of a 20-year-old college student were identified on Tuesday night after they were shot dead in the street during a murder and carjacking spree.\n\n\n\nBusiness owner Melvin Lee Edwards, 69, was on his way to work when he crossed paths with shooter Ali Syed, of Ladera Ranch, California and was killed 'execution-style', witnesses said .\n\nThe second male victim, 26-year-old construction worker Jeremy Lewis of Fullerton, was killed a short time later at an electronics store and his small truck carjacked.\n\n\n\nSyed was identified by police on Tuesday afternoon, hours after the early morning massacre which began at his family home.\n\nHis first victim, described as a woman in her 20s, was not identified.\n\n\n\nShe was not related to the shooter and it is unclear what she was doing at the home.\n\nSyed's 25-minute shooting spree through Orange County left a bloody trail of dead and injured victims in a series of carjackings and gunfire, police said.\n\nAuthorities reported at least five places where victims had been shot in the early morning violence - and at least four are dead - including Syed who took his own life.\n\n\n\nAuthorities said Syed was taking one course at Saddleback College, a two-year community college.\n\n\n\nThe shootings began at 4.45am when deputies responding to a call found the body of a female who was shot multiple times in a house in Ladera Ranch, Orange County sheriff's spokesman Jim Amormino said.\n\nPolice said Syed's parents and several children were in the home at the time, but were not injured.\n\nFrom Ladera Ranch, police said the gunman, armed with a shotgun, headed north and within 30 minutes carjacked a Dodge pickup truck in Tustin, 20 miles away. The driver was uninjured, but a bystander was hit by gunfire and hospitalized.\n\nScroll down for video\n\nAmbushed: Jeremy Lewis, of Fullerton, was carjacked and shot dead early on Tuesday in California\n\nFatality: Melvin Edwards, 69, was shot dead during the shooting spree in California on Tuesday in what several witnesses described as an 'execution'\n\nHouse of horrors: Police today identified Syed's first victim who was shot dead at his parents' house on Red Leaf Lane in Ladera Ranch, California\n\nKiller: Syed's body is covered by a tarp after his chaotic shooting spree ended early on Tuesday morning\n\nFirearm: Police investigators examine Syed's shotgun at the intersection of Wanda Road and Katella Avenue, where he killed himself with the weapon\n\nTrail of blood: Orange County coroner's officials remove Sayed's body from the scene\n\nGunshots: The body of one of the shooting victims is examined by law enforcement officers\n\nAccording to police, Syed told one of the men: 'I don’t want to hurt you. I killed somebody. Today’s my last day, give me your keys.'\n\nBetween 5.30am. to 5.55am, Tustin police received numerous calls about shootings in several locations, he said.\n\nThe first call that came in was at Red Hill Avenue and Interstate 5, where a truck was stolen from a Mobil gas station.\n\nAfter that carjacking, Syed then began spraying the freeway with bullets, hitting several drivers.\n\n\n\nThree people reported being targeted, including one who suffered a minor injury, Tustin police Lt Paul Garaven said. Two cars were damaged.\n\nViolence: Syed ran after this Cadillac as the driver tried to get away, and the gunman shot through the back window, striking the driver in the head but not killing him\n\nTimeline: This map shows the various locations of violence during the gunman's shooting spree in California\n\nGrisly: A body is surrounded by police vehicles at one of the crime scenes\n\nVictom: The Orange County coroner's office wheels a body to a waiting van after the shooting spree\n\nGruesome: Investigators gather in front of Syed's parents, where he shot Courtney Aoki to death in Ladera Ranch\n\nWhen the truck got low on gas a short time later, Sayed stopped at State Route 55 and McFadden Avenue in Santa Ana, where he forced the driver out of the car, killed him, and took his BMW.\n\nThe driver was identified as business owner Melvin Lee Edwards, 69, who was on his way to work when he crossed paths with Syed. Santa Ana police Cpl Anthony Bertagna said: 'He was basically executed. There were at least six witnesses.'\n\nThe shooter then drove to a Tustin Micro Center electronics store and carjacked another small truck, after killing its driver, identified as 26-year-old construction worker Jeremy Lewis of Fullerton.\n\nWhen another worker at a nearby construction site approached Syed, the gunman told him to run - and with his back turned - Syed shot him, striking him in the arm. He then drove off.\n\n\n\nMeeting: Police officers huddle at an intersection while the body of one of the dead is covered with a yellow tarp at right\n\nChatoic scene: Law enforcement officers inspect one of the bodies\n\nBut his shooting and car-stealing spree ran came to an end as officers from the California Highway Patrol located Syed and followed him into the city of Orange, Garaven said.\n\nOrange County sheriff's spokesman Jim Amormino said: There wasn’t a confrontation at that very end. It happened so quickly.'\n\n\n\nHe pulled into the intersection of Katella Avenue and Wanda Road, exited the still-moving vehicle, where he quickly shot himself in the head with the same shotgun.\n\nThe motive for the shootings is still unclear.\n\nTustin is about 35 miles southeast of downtown Los Angeles.\n\nTerror on the streets: A Tustin police officer speaks to the media as a handout image is posted of 20-year-old Ali Syed\n\nA closer look: A police investigator looks under a disabled SUV that was apparently driven by the gunman in Tustin\n\nSpree: Between 5:30am to 5:55am, Tustin police received numerous calls about shootings in several locations\n\nViolence: A Tustin police officer looks at one of several crime scenes on Red Hills Avenue - under the 5 Interstate in Tustin\n\nStationed: An Orange police officer directs traffic as an investigation into the shootings continues\n\nShooting scene: Police vehicles are stationed at one of the locations where multiple victims were shot\n\nCrime scene: Officers move a tent at one of the sites where a victim was shot", "publish_date": "2013-02-19"}, {"text": "2 killed, 2 hurt in Vallejo shooting\n\nPolice in Vallejo are investigating a shooting that killed two and injured two others Saturday night.\n\nOfficers responded to a report of multiple people shot at a party in the first block of Linfield Drive at about 11:40 p.m., police said.\n\nWhen officers arrived, they found four people suffering from gunshot wounds, according to police.\n\nTwo men were pronounced dead at the scene; another man was grazed in the head by a bullet but is expected to survive; and a juvenile boy was transported to a hospital to be treated for minor injuries, police said.\n\nThe suspect fled the area on foot after the shooting, police said. He is described as a Latino man between 20 and 30 years old, between 5 feet 6 inches and 5 feet 8 inches tall, with a medium build, a goatee and a mustache, according to police. He was last seen wearing a black hoodie.\n\nThe names of the deceased men have not yet been released, police said.\n\nAnyone with information about the shooting is asked to call Vallejo police at (800) 488-9383.\n\nCopyright © 2013 by Bay City News, Inc. -- Republication, rebroadcast or any other reuse without the express written consent of Bay City News, Inc. is prohibited.", "publish_date": "2013-06-02"}, {"text": "Jimes Gillespie, 20, told The Associated Press he was in the college's library studying when he heard the gunfire, and he and dozens of other students began fleeing the three-story building.\n\n\"As I was running down the stairs I saw one of the gunmen,\" said Gillespie, who described the shooter as a white man in his 20s, wearing cornrows in his hair and black overalls. He said the man was carrying a shotgun.\n\nGillespie believes there were two shooters because he heard two kinds of gunfire – a shotgun and a handgun – but only saw one person.\n\n\"The shotgun blast was first. It was either him or the partner who shot eight to 10 handgun shots,\" Gillespie said. \"Then after I saw the gunman I heard more shots and I ran out of the library through the emergency exit.\"\n\nAs Gillespie ran away across campus, he said he saw a car in front of the English building that was riddled with bullet holes, had shattered windows and a baby's car seat in the back.", "publish_date": "2013-06-07"}, {"text": "A man convicted of shooting four people during a dice game will spend the rest of his life in prison.Joshua Hurst was convicted in August of two counts of murder, two counts of aggravated assault and one count of being a felon in possession of a firearm.Police said the shooting happened on March 7, 2013, on Greenwood Avenue in Jackson. Ronald Williams, 33, and Kendra Hill, 28, were killed, and Jason Kimble and Laquintin Carter were injured in the shooting.Hinds County Circuit Court Judge Jeff Weill on Wednesday sentenced Hurst to life in prison without the possibility of parole.\n\nA man convicted of shooting four people during a dice game will spend the rest of his life in prison.\n\n\n\nJoshua Hurst was convicted in August of two counts of murder, two counts of aggravated assault and one count of being a felon in possession of a firearm.\n\n\n\nPolice said the shooting happened on March 7, 2013, on Greenwood Avenue in Jackson. Ronald Williams, 33, and Kendra Hill, 28, were killed, and Jason Kimble and Laquintin Carter were injured in the shooting.\n\n\n\nHinds County Circuit Court Judge Jeff Weill on Wednesday sentenced Hurst to life in prison without the possibility of parole.\n\n\n\nAlertMe", "publish_date": "2014-09-17"}, {"text": "× 4 Shot, 2 Killed In South Memphis Apartment Complex\n\n(Memphis) Memphis police are on the scene of a deadly shooting in the Woodbridge Crossing Apartments.\n\nMPD Spokesperson Sgt. Alyssa Macon-Moore tells WREG officers were called to the scene in 2300 block of Ketchum just before 7:00 p.m. Sunday night.\n\nThey found three people suffering from gunshot wounds. They were taken to The Med by ambulance. Another victim had been taken to the Med by private vehicle.\n\nTwo of those victims have since been pronounced dead.\n\nNo arrests have been made.\n\nWe have a crew on this scene gathering information and will bring you the latest information on WREG News Channel 3 at 10:00 p.m.", "publish_date": "2013-05-19"}, {"text": "Four people were injured during a shoot out in York City late Monday night. Police were dispatched shortly before midnight to the 600 block of West Princess Street for a report of shots fired. When they arrived on scene they found four shooting victims, including a juvenile female.\n\nDaquez Palmer, Joseph Ramos, Que’sean Brown, and the juvenile female, all of York, were taken to York Hospital for treatment. Hospital officials say all of their injuries are non-life threatening.\n\nA neighbor tells FOX43 News that he heard 5 or 6 shots go off during the melee.\n\nPolice have not identified any suspects as of Tuesday morning.\n\nAnyone with information is asked to contact police at 717-846-1234.", "publish_date": "2013-06-11"}, {"text": "The District Attorney’s Office has announced that it will not seek the death penalty against a group of men charged in the fatal shootings of two teens last year at Libby Lake Park in Oceanside.\n\nMartin Melendrez, 23; Santo Diaz, 20, and Michael Zurita, 21; and Kevin Brizuela, 19, each face two counts of murder and two counts of attempted murder in connection with the shootings on March 13, 2013.\n\nThe men also face special-circumstance allegations of multiple murders, which gave prosecutors the option of seeking the executions of three defendants who were adults at the time of the shootings. They now face life in prison without the possibility of parole if convicted.\n\nBecause Brizuela was 17 when the killings occurred, he is not eligible for the death penalty. However, he could be sent to prison for life if he is found guilty.\n\nDeputy District Attorney Christine Bannon made the announcement Tuesday in front of Vista Superior Court Judge Carlos Armour. She did not give any specific reasons as to why prosecutors declined to seek the death penalty, but she explained that District Attorney Bonnie Dumanis had met with the defense lawyers in the case, as well as other high-level prosecutors in her office and consulted with the victims’ family members.\n\nThe defendants are accused of ambushing and killing Melanie Virgen, 13, and Edgar Sanchez, 15, on a hilltop at the Oceanside park. The pair was seated on a couch near a makeshift memorial for two other teens gunned down at the same spot in 2011.\n\nPolice and prosecutors have said the 2013 attack was motivated by a gang rivalry, but the victims, including two older teen boys who were wounded but survived, did not have gang ties.", "publish_date": "2014-12-16"}, {"text": "", "publish_date": ""}, {"text": "Four people were shot — one fatally — in an apartment at a Coney Island housing project on Friday afternoon, the police said.\n\nThe shooting happened just before 4 p.m. after a man knocked on the door of a fifth-floor apartment in the Gravesend Houses, at 2703 West 33rd Street. A woman, 62, answered the door and let the man in. Investigators said he asked to speak with a 24-year-old man who was in a bedroom. The suspect went to the bedroom, shut the door behind him, and shot the other man in the head, the police said. The wounded man was in critical condition at Lutheran Medical Center in Brooklyn, the police said.\n\nImage The suspect, identified by the police as Joseph Brown, 29, remained at large on Friday night. Credit Nypd\n\nThe suspect left the bedroom, the police said, and shot three other people in the apartment: a 40-year-old man in the living room who suffered a graze wound to the head; the 62-year-old woman, who was shot in the stomach; and another man in the living room, who was shot in the head and died.", "publish_date": "2013-03-23"}, {"text": "CHICAGO (STMW) — Four people were wounded in a Thursday afternoon shooting on a South Shore neighborhood street — just a block away from where five people were wounded in a December shooting.\n\nThe four males were shot about 3:15 p.m. outside in the 2500 block of East 75th Street, police said. Their ages were not immediately available.\n\nParamedics took two victims to John H. Stroger Jr. Hospital of Cook County, one to Northwestern Memorial Hospital and one to South Shore Hospital, according to Fire Media Affairs. The conditions of the wounded ranged from good to critical.\n\nThe shooting happened just a block from the site of a Dec. 3 incident that left five people wounded at a bus stop at East 75th Street and South Exchange.\n\nIn that shooting, witnesses said two men approached a group standing on a corner and opened fire. Four of the victims were critically injured.\n\n(Source: Sun-Times Media Wire © Chicago Sun-Times 2013. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed.)", "publish_date": "2013-02-07"}, {"text": "STRUNK [mdash] Donald P., Sr., 74, Cresson, passed away April 13, 2019. Born September 11, 1944, Altoona, son of the late Homer P. and Gertrude M. (Galbrath) Strunk. Preceded in death by his loving wife, Phyllis L. (Maloney); and sisters, Margie, Betty, and Doris. Survived by his three sons,…", "publish_date": ""}, {"text": "Lexington police have made an arrest in a shooting at a bowling alley that left one person dead and injured four others.Police told the Lexington Herald-Leader that 22-year-old Devonte Laval Webb was charged Wednesday with murder in the shooting that killed 22-year-old Steven Reynolds on April 14.Hundreds of people were at Eastland Bowling Lanes, which was hosting an event called Soul Bowl, at the time of the shooting.It wasn't clear whether Webb has an attorney.\n\nLexington police have made an arrest in a shooting at a bowling alley that left one person dead and injured four others.\n\nPolice told the Lexington Herald-Leader that 22-year-old Devonte Laval Webb was charged Wednesday with murder in the shooting that killed 22-year-old Steven Reynolds on April 14.\n\n\n\nAdvertisement Related Content Ky. police piecing together bowling alley shooting\n\nHundreds of people were at Eastland Bowling Lanes, which was hosting an event called Soul Bowl, at the time of the shooting.\n\nIt wasn't clear whether Webb has an attorney.\n\nAlertMe", "publish_date": "2013-06-20"}, {"text": "The New Orleans Police Department said that five people were shot in Central City on Monday afternoon. Police said that the shooting occurred shortly after 1 p.m. on the corner of LaSalle Street and Martin Luther King Jr. Boulevard.\n\n\n\nFive shot on Martin Luther King Blvd, New Orleans 5 Gallery: Five shot on Martin Luther King Blvd, New Orleans\n\nThe shooting occurred near where the annual Martin Luther King Jr. Day parade had passed some 30 minutes earlier. The shooting did not appear to be related to the parade, authorities said.\n\nNew Orleans Police Superintendent Ronal Serpas said that the shots were fired out of a white, two-door sedan that drove by a grocery store located near the intersection of both streets. Rapid shots were fired at a group of teenagers who were standing outside.\n\nFive people were shot, Serpas said. All of the victims were male, Serpas said, and they were taken to an area hospital to be treated for their injuries, none of which appeared to be life-threatening.\n\nThe car was seen fleeing down Martin Luther King Jr. Boulevard toward the river and disappeared into the surrounding neighborhood, Serpas said, adding that video surveillance would soon be made available to the public.\n\nAuthorities said the shooting did not appear to be related to the Martin Luther King Jr. Day parade, which passed by about 30 minutes prior as residents participated in the 27th annual march to King's statue on Martin Luther King Jr. Boulevard.\n\n\"It's the state of affairs in our nation that young men do not heed the words of Martin Luther King Jr.,\" Serpas said.\n\nCheck back in with NOLA.com for more on this breaking story.", "publish_date": "2013-01-21"}, {"text": "We attempted to send a notification to your email address but we were unable to verify that you provided a valid email address. Please click here to update your email address if you wish to receive notifications. Otherwise, you may click here to disable notifications and hide this message.", "publish_date": ""}, {"text": "PHOENIX — A birthday party in north Phoenix turned deadly Sunday.\n\nGunfire rang out after 3 a.m. Sunday morning outside a home near 25th Avenue and Cactus Road. Jason Jonathan Acosta-Ramos, 18, who was celebrating his birthday, and Elliseo Cantu, 16, were killed. Four others were also shot and critically hurt.\n\nSgt. Tommy Thompson told KTAR that two of the victims are 16 and 17.\n\n“That age group, it just shocks you when those are the individuals involved in this type of activity,” Thompson said.\n\nThompson said someone in a car opened fire as the party was breaking up. They have little vehicle or suspect information and want to hear from anyone with information. Anonymous tips can be made to 480-WITNESS.", "publish_date": "2013-04-14"}, {"text": "The Metropolitan Police Department has released surveillance video capturing an early morning drive-by shooting in Northwest D.C. on camera. Eleven people were injured when gunmen opened fire in front of a crowd outside an apartment building. (The Washington Post)\n\nThe Metropolitan Police Department has released surveillance video capturing an early morning drive-by shooting in Northwest D.C. on camera. Eleven people were injured when gunmen opened fire in front of a crowd outside an apartment building. (The Washington Post)\n\nD.C. police announced on Thursday their first break in Monday’s early morning drive-by shooting on North Capitol Street, posting pictures of two 19-year-olds being sought in connection with the wounding of 13 people outside an apartment building.\n\nLate Thursday night, police announced that they had issued an arrest warrant for Craig Wilson for assault with intent to kill in connection with the mass shooting. Wilson has a revolver tattoo on his neck and is described as 6-foot-2 and weighing 140 pounds, authorities said.\n\nThe statement came hours after police officials identified Wilson and Andrew Davon Allen as people of interest in the case.\n\n“We’re trying to locate and interview two people we believe have information on the case,” Cmdr. George Kucik told reporters outside D.C. police headquarters in the afternoon.“We’re looking to see if anyone knows where they might be.”\n\nKucik had a message for the men: “Reach out to us. Come in and talk to us.”\n\nCraig Wilson (Courtesy of D.C. police)\n\nFive hours later, police announced the arrest warrant for Wilson but did not release details or why they considered Wilson a suspect.\n\nPolice also said they had located one of the two vehicles used in the shooting, which occurred about 2:10 a.m. on North Capitol Street, just off New York Avenue in front of an apartment complex called Tyler House.\n\nPolice haven’t found the other vehicle, Kucik said, described as a dark blue or black 1999 Mercedes-Benz CLK 320 coupe with D.C. license plates EF7810. Police have posted a $10,000 reward for anyone with information leading to an arrest and conviction.\n\nMost of the victims suffered minor wounds to their legs and arms, though one was struck in the lower back and critically injured.\n\nThe number of victims startled a city in which gun violence has been dropping. It occurred at the edge of a neighborhood transitioning into a gentrified district of condos, retail stores and offices. A name given by developers, NoMa, short for north of Massachusetts Avenue, has stuck.\n\nBut Monday’s violence and the fact that several victims, including three sisters, had just emerged from a mega-nightclub ignited old discussions over gentrification. A D.C. Council member proclaimed the area’s clubs, which existed before the latest burst of redevelopment, to be incompatible with the changing area, while a police commander pointed at crime from Tyler House, a subsidized tower of apartments.\n\nPolice have not described a motive, and they said little about the case Thursday. Authorities have indicated that they are looking into whether a dispute at the club precipitated the violence, or whether the incident is tied to long-standing beefs between neighborhood crews from Tyler House and those on the other side of New York Avenue in Truxton Circle.\n\n“There’s a lot to do in this case,” Kucik said. “We’re getting there.”", "publish_date": "2013-03-14"}, {"text": "GALT—\n\nAuthorities have declared a mass-casualty incident after a reported shooting in Galt.\n\nA total of seven people had to be treated for non-life threatening wounds after a drive-by shooting along Dover Court, police say.\n\nThe victims were all standing in a front yard when a car passing by opened fire.\n\nDetectives and people at the scene believe that the shooting may be gang related.\n\nFive medic units, along with four engines, showed up at the scene, according to Cosumnes Fire.\n\nOne victim has already been released from the hospital, police say.\n\nAnyone with information about this crime is asked to call the Galt Police Department immediately at (209) 366-7000.\n\nCecilio Padilla contributed to this report.", "publish_date": "2013-03-16"}, {"text": "A man is transported from a home in Englewood after Monday afternoon's shooting. View Full Caption DNAinfo/Darryl Holliday\n\nENGLEWOOD — Four men were wounded in a Monday afternoon shooting, police said.\n\nThough none of the victims seemed to have been seriously injured in the shooting in the 5700 block of South Lowe Avenue about 4:20 p.m., police expressed worry about violence to come.\n\n\"Seems like no one was hurt too badly, but that's not what I'm worried about,\" said Englewood Deputy Chief Leo Schmitz. \"I'm hoping it doesn't get worse.\"\n\nThe four men — who range from 19 to 34 years — were shot in their legs, though one might have had an arm wound as well, police said.\n\n\"We were just sitting in the car and that's when we heard the shots, like POW POW POW — about eight or nine shots,\" said Brenda Ford.\n\nAt least two victims were taken from a house in wheelchairs to ambulances, according to one reporter. Witnesses said eight to 10 people emerged from a gangway and opened fire.\n\nFord said her 32-year-old son Vincent Ford was one of the people shot.\n\nBrennan Ford, Vincent Ford's brother, called the area a \"family block.\" The family had driven to the neighborhood and dropped off Vincent to visit other family members, Brennan Ford said.\n\n\"We thought it was firecrackers until everyone started ducking,\" said Brennan Ford, who said his brother is not part of a gang.\n\nThe family pulled away after dropping off Vincent Ford and hadn't turned at the end of the block when they heard shots and returned to the scene.\n\nFord and another shooting victim were transported to Stroger in serious-to-critical condition, said Meg Ahlheim, a Chicago Fire Department spokeswoman.\n\nThe other two victims were sent to Mount Sinai Hospital, Ahlheim said. One was in serious-to-critical condition and the other was fair-to-serious, she said.\n\nPolice had no more information.", "publish_date": "2013-04-22"}, {"text": "Four people were shot, one man fatally, outside a North Long Beach home Sunday, a Long Beach police spokesperson said.\n\nParamedics rushed Randy Chapman, 23, to an area hospital, where he died from a gunshot to the upper torso, according to a department statement.\n\nThe shootings were reported at 12:05 a.m. in the 300 block of East Home Street, according to police.\n\nThe victims were standing outside a home when they were shot multiple times. The suspects fled the location.\n\nTwo victims were listed in critical condition at an area hospital. Another victim was treated and released.\n\nLong Beach police detectives asked anyone with any information regarding the shooting attack to call them at (562) 570-7244.", "publish_date": "2013-04-07"}, {"text": "Updated at 4:45 p.m. ET: Officials in Oklahoma said four people were found shot dead at a Tulsa apartment on Monday.\n\nPolice responded to the scene in the south part of Tulsa at around 12:30 p.m. local time, where four women were found dead inside the Fairmont Terrace apartments, NBC station KJRH reported.\n\n\"The victims were shot multiple times,\" Tulsa Police Officer Jillian Roberson confirmed in a statement to NBC News.\n\nAuthorities also found an unharmed 4-year-old child in the apartment, Roberson said. The child was taken into protective custody.\n\n\"It's not everyday you see something like this in the city of Tulsa,\" Tulsa Police Officer Leland Ashley told the Tulsa World. \"It's very tough right now.\"\n\nStay informed with the latest headlines; sign up for our newsletter\n\nThe police’s early investigation indicates an individual went inside the apartment and found the four dead females and the unharmed child inside, Roberson said. Officials suspect someone spoke with an occupant of the apartment an hour before the bodies were found, KJRH reported.\n\nThe victims have not been identified.\n\nThe crime remains under investigation, while police look for witnesses.\n\nThis story is still developing. Check back for updates.\n\nMore content from NBCNews.com:\n\nFollow US news from NBCNews.com on Twitter and Facebook", "publish_date": "2013-01-07"}, {"text": "Codarrell Lee Yates, a 22-year-old man from Nottoway County, pled guilty recently in Lunenburg Circuit Court to four felony wounding charges, one count of use of a firearm in the commission of a felony, and possession of a firearm by a felon and was sentenced to twenty-five years in prison. He received an additional 93 years suspended upon numerous conditions.\n\nYates also has an additional five years to serve on Nottoway County convictions this year for grand larceny and breaking and entering.\n\nAccording to Commonwealth Attorney Robert Clement, a jury trial was planned for November 4th and 5th, but the defendant expressed a willingness to plead guilty in exchange for an agreed-upon sentence. Clement said that he would have preferred a more significant sentence, but due to a “snitch” mentality among nearly all of the witnesses, he felt more secure with a “sure thing” rather than having to count upon reluctant, uncooperative witnesses. “Some refused to talk to law enforcement, and some refused to meet with me,” said Clement. The prosecutor did, however, highly commend one of the victims, Standrekas Woods, for his full cooperation, precise observations, and ability to express his testimony fully and forcefully. Clement added that the victims and law enforcement officers agreed to the disposition.\n\n“Ironically, those persons who did not want to “snitch” did not realize that Yates “snitched” on one of his closest friends, Robert “Chuckie” Fields, the driver of the vehicle. In his interview in Texas where he was found after the shooting, Yates said he had left the party before the shootings, and that Fields had given him the gun to take to Texas later that day. He said Fields admitted to him in a telephone conversation that Fields had shot the men.\n\nFields, on the other hand, would not identify Yates as the shooter in his first four interviews until he was shown the video of Yates in Texas blaming him for the shooting. Fields then went ballistic, calling Yates a liar and saying Yates was the shooter. He then looked right into the camera in the interview room and shouted, “You’re (deleted) whacked. You are lying. You’re supposed to be my (deleted) brother, man.” He told the investigator to be sure she showed Yates the video of this interview. “Don’t let him miss it.” He then raised his hands up, showing the handcuffs to the camera, and said, “It’s because of you.””\n\nYates will be under conditions of good behavior for 118 years, supervised probation for five years upon his release, warrant-less searches and seizures, no contact with the victims, restitution for any medical expenses, not knowingly being within 100 feet of any firearms except law enforcement officers and commercial establishments, and staying out of Lunenburg County for ten years upon his release.\n\nAccording to Clement, the charges arose from a shooting at 2073 Pleasant Oak Road, Victoria, Virginia after physical altercations between Lunenburg men and Nottoway men during a birthday party for a Lunenburg female on May 18, 2013.\n\nDetails provided below were taken from a written Stipulation of Evidence signed by the defendant as to what he expected the Commonwealth to prove in court, revealed the following facts:\n\nAll witnesses would have been in agreement that Richsean Hawkes hosted a birthday party cookout for Destiny Brown, a friend. Approximately 25 to 35 individuals eventually showed up.\n\nA number of the witnesses became aware that around 11:30 p.m., Robert “Chuckie” Fields drove up in his father’s minivan with six friends from Nottoway. (Fields is the father of the baby of Destiny Brown). A number of the witnesses expressed concern that the “Nottoway” men had come to the party, because of past tensions with Lunenburg County individuals. They would testify that Brandon Townsend of Lunenburg stood on the front porch at one point and angrily yelled at one of the Nottoway men, “What are you looking at?” because of the manner and stance that the Nottoway man posed. Townsend was convinced by some of the women to go back into the house, but came out later and fussed again. One of the Nottoway men yelled something to the effect of not being disrespected in this way. As some of the Lunenburg and Nottoway men became more aggressive, some of the Lunenburg men and women tried to defuse the situation and calm them down. Two of these men who tried to calm things down were the victims, Stan Woods and Dequan Jones. Witnesses would say that Dequan Jones was then jumped and hit from the side, and then fought back. As he was fighting, another Nottoway man tried to get him, but a Lunenburg man pushed him away, and said words to the effect that it would have to be a fair fight, one on one. He pushed the Nottoway man twice to stop him, and they ended up in the road in front of the house. They squared off with each other to fight, and the Lunenburg man hit him in the face with one punch and knocked him out. Stan encouraged Chuckie Fields to get his friend and leave. Chuckie dragged his friend to the minivan, put him inside, and the other Nottoway men got inside also.\n\n(Some of the Nottoway men said the minivan was surrounded and being hit and kicked, but none of the Commonwealth’s Lunenburg witnesses confirmed this.)\n\nAt this point, shots were fired. Five or six witnesses would testify that the shots came from inside the minivan which was parked at the back of the driveway facing the house, with five shots fired through the windshield, and two more shots fired from the side after the van had backed into the road and as it drove away.\n\nThe four victims were hit by the gunfire as described below.\n\nStandrekas “Stan” Woods is a 2009 graduate of Central High School, and attended one year at the local community college before becoming a correctional officer for the Virginia Department of Corrections.\n\nStan said that around 11:00 pm or 11:30 p.m., his friend, Richsean Hawkes, called and asked him to come to his house and drive him to town to buy some cigarettes because he had been drinking and did not want to drive. When he came back, he sat on the porch talking to Hawkes and one of the Nottoway men in friendly conversation.\n\nWhen the arguments began, Stan stopped one Lunenburg man from being aggressive toward the Nottoway man who had been on the porch, pointing out that he had not done anything.\n\nStan then went to get his younger brother, Dontaris, in order to leave. He saw the fights described above, and peacefully encouraged the Nottoway men to leave. He and his brother walked to his car in the driveway where it was parked just in front of the minivan. He walked around the front of the car, and Dontaris walked behind the car calling out for a friend who had ridden with him. His car was parked on the road further beyond the driveway.\n\nStan said that as he put the key in lock to the door of his car, he heard two shots, and saw his brother, Dontaris, fall to the ground. He then turned and looked at the minivan, saw two bullet holes in the windshield, and plainly saw the defendant, Codarrell Yates, pointing a handgun toward him from inside the minivan from the back, reaching between the two front seats. The ceiling light was on just above his face, giving Stan a good view of Yates. Stan said Yates yelled, “THAT’S HOW YA’LL WANT TO PLAY ? AIN’T NO REASON TO RUN NOW.”\n\nStan said he could see Chuckie (Robert Fields) in the driver’s seat, and the light-skinned guy in the passenger seat.\n\nStan said YATES looked at him dead in the face, pointing the gun at him.\n\nSTAN yelled “NO!!!” and saw and heard the shot fired by Yates and felt the bullet hit him in the chest.\n\nSTAN sank down by the car, and played dead. He said he heard two more shots, and then a few seconds later he heard two more shots down the road just as the van accelerated and drove away.\n\nStan looked up and saw they were gone. He said he ran around the car and went up to the sidewalk where he fell.\n\nA friend and other Lunenburg men and women got shirts, towels and sheets and applied pressure to the wounds of the four victims.\n\nStan said he looked up at the moon, which was nearly full, and thought, “This is the last moon I’m going to see.”\n\nStan was driven to the hospital in South Hill along with Trey Ghee, who had been injured. Dequan Jones and Dontaris Woods were driven to the Victoria Rescue Squad and transported to South Hill. All four men were then transported to MCV Hospital in Richmond.\n\nDequan Jones also attended Central High School. He would testify concerning the fighting described above, and said he then walked over to his car which was parked a little further up the driveway in front of Stan. He would testify that he heard the gunfire and turned to look, but then turned back to the person he had been talking to. He then suddenly felt a burning pain to his right ear. It turned out that a bullet had cut his earlobe and either the same bullet or a second bullet entered the side of his head at the ear while his head was turned sideways. He said he did not see the shooting itself.\n\nDontaris Woods apparently was the first man shot, but said he did not see the shooting itself. He was struck in the face and in his left arm near the wrist.\n\nTreyvious Ghee said he came out of the house and saw the fighting going on. As he and a friend were walking in the yard, he was hit in the side of his head, just above his ear. He fell to the ground unconscious. He also did not see the shooter.\n\nFemale Witness, who will not be identified here at her request, said that she saw a man standing in the minivan “with hair” (referring, she said, to long braids, like the defendant had) shooting from the side of the minivan as it drove away.\n\nRobert “Chuckie” Fields was the man who drove the Nottoway men to the party. He is charged as an accomplice (for driving the vehicle as the last shots were fired and getting away from the scene, allowing Yates to flee). He is charged with the same crimes as Yates, except for the possession of a firearm by a felon.\n\nFields was interviewed by law enforcement at least four times, refusing to identify the shooter, at times stating he just heard the shots and ducked down in the driver’s seat, and stating that one of the friends was still unconscious from being knocked out in the fight, and another friend in the front passenger seat fainted when the first shot rang out. He always strongly denied that he had shot the gun. He later said that the police knew who had shot the gun, but he would not say the name.\n\nIn exchange for his agreement to testify against Yates and his agreement to waive the preliminary hearing, the Commonwealth has agreed to allow Fields to plead guilty to one count of malicious wounding as an accomplice and receive one year active sentence.\n\nYates fled to Texas later in the day, driven by a female friend, Deidre Fowlkes. When found by law enforcement officers in Arlington, Texas, Yates ran on foot, and tried to hide in some brush. A tracking dog was used, and he was found lying in some tall grass. At first he would not get up as commanded, but when police threatened to release the dog, he jumped up. He said he had fled to Texas to avoid a sentencing hearing in Nottoway Circuit Court on a conviction of burglary the Monday after the party.", "publish_date": ""}, {"text": "Jury Returns with Verdict in Downtown Double Homicide\n\nThis video is no longer available.\n\nJACKSON, Tenn. – A man who was on trial in connection to a double murder was found guilty, Wednesday afternoon. The jury deliberated for about a half hour before returning with the verdict on the reckless endangerment and tampering with evidence charges. On April 28 around 3:05 a.m., police were called to a shooting at Wolfe Enterprises at 438 E. Main Street. Officers arrived to find Banes and Clark, both 31, of Jackson, with apparent gunshot wounds. They were transported to Jackson-Madison County General Hospital where they were later pronounced dead. Two other gunshot victims arrived at the hospital via personal vehicles. The investigation determined there was an argument on the parking lot of 438 E. Main Street as a party was letting out. Berry was allegedly the first person to fire a semi-automatic handgun into the air while he was standing in a crowd of people. Anthony Montrell Swift, of Jackson, is accused of shooting Brian Banes and Delandis Clark multiple times. After the shootings, police said that Berry left the scene and disposed of the weapon that he fired. Swift will be on trial on March 25.", "publish_date": "2014-02-19"}, {"text": "Your son earns his Eagle Scout Award. Your church hosts a bake sale. Your councilman’s fence violates city ordinances.\n\nBut is it news?\n\nLearn what makes a happening “newsworthy” and get tips on working with staffers to publicize your story or event at the next gathering in the Sun News Lounge.\n\nEditors and reporters will be on hand from 3 to 5 p.m. Wednesday, May 15, at the Lounge located in The Sun’s office at 290 N. D St., Suite 102, San Bernardino. Staffers will discuss how to contact the newsroom; what is news and what is not; opportunities to tell your story online; and the difference between news stories and letters to the editor and other submissions printed on the Opinion pages. There will also be time for a Q&A session with editors and writers.\n\nSpace is limited; to RSVP please email Metro Editor Ryan Carter at ryan.carter@inlandnewspapers.com or call 909-386-3810.", "publish_date": "2013-01-05"}, {"text": "Two men who opened fire during a 7th Ward Mother's Day parade in 2013, leaving 20 people injured, pleaded guilty to federal charges Wednesday (Sept. 9).\n\nBrothers Akein \"Keemy\" Scott and Shawn \"Shizzle\" Scott entered guilty pleas to racketeering and conspiracy charges, as well as counts related to a total of five shootings they committed as members of \"FnD,\" a street gang that took its name from the intersection of the Frenchmen and Derbigny streets.\n\nThe Mother's Day shooting, in which 19 people were struck by gunshots as the Scott brothers fired at a rival gang member, was one of five shootings committed by FnD members.\n\nThe brothers entered their pleas standing alongside a third brother, 23-year-old Stanley \"Stizzle\" Scott, in U.S. District Judge Ivan Lemelle's courtroom. Each of the three face 20 years to life in prison when they are sentenced in January.\n\nTheir joint plea deals with prosecutors do not require them to testify against the lone FnD member still facing trial, their older brother, Travis \"Trap\" Scott, Assistant U.S. Attorney Matthew Payne said. Travis Scott is set to go to trial next month as the alleged leader of FnD.\n\nNew Orleans Police say Akein Scott, 22, and Shawn Scott, 26, took up positions on opposite sides of Frenchmen Street as the May 12, 2013 parade passed near North Villere Street, and opened fire at a rival gang member, identified in court records by the initials \"J.T.\"\n\nThe melee was retaliation for a prior shooting that wounded Stanley Scott by members of the Prieur and Columbus Boys, a rival gang also known as \"PCB,\" police said.\n\nNineteen bystanders were wounded, including J.T., who was struck five times, according to court records filed along with Akein, Stanley and Shawn Scott's guilty pleas. Another person was trampled as panicked parade-goers fled the shooting.\n\nProsecutors allege FnD members trafficked heroin and crack cocaine in the 7th Ward dating back to 2006. Nine FnD members, most of them members of the Scott family, were charged in a federal indictment in 2014.\n\nSurveillance video showed the densely packed crowd along the parade route scattering amid the gunshots, images that shocked even city residents accustomed to occasional outbreaks of violence along parade routes.\n\nAmong the those struck by bullets were two 10-year-old children, who suffered graze wounds. The shooter shown in the video, according to court records, was then 20-year-old Akein Scott.\n\nIn the weeks that followed, organizers hosted a \"do over\" of the parade and multiple fundraisers were held for the injured even as police conducted a manhunt for the shooting suspects.\n\nIn court records, FnD members who have pleaded guilty have admitted to selling drugs over a territory bounded by Elysian Fields Avenue, North Johnson, Interstate 10, St. Anthony Street and North Claiborne Avenue.\n\nThe center of the gang's operation was the Frenchmen Meat Market, where workers would hold guns behind the counter for FnD members, and would let patrons swap food stamps for cash that they then handed over to FnD members for heroin or crack.\n\nSurveillance video from the store's own cameras was noted as evidence prosecutors intended to use at trial, with footage showing FnD members making numerous drug deals inside the store.\n\nTravis Scott often carried an AK-47 rifle he called \"monkey nuts,\" a reference to the massive drum magazine that could hold 100 rounds, according to court records.\n\nAkein Scott, now 22, sold drugs at the store several days a week, mostly in the afternoon after returning from school, one unnamed witness said in court records. As one of the younger members of the gang, Akein often was told to hang onto firearms for older gang members, because as a juvenile, he would face less serious penalties from authorities if he was caught with the weapons.\n\nIn court records, Akein Scott admitted to pulling the trigger himself in four shootings during the year before the 2013 Mother's Day parade, joining Shawn and Stanley Scott in a shootout in front of the Frenchmen Meat Market in which a 14-year-old girl riding in a passing vehicle was shot in the leg.\n\nOn Mother's Day 2013, Akein Scott is seen on surveillance video as the second-line parade moves down the block, stepping out from the side of a building with a pistol raised and firing into the terrified marchers, according to court records.\n\nWhen asked about his background by Judge Lemelle on Wednesday, Akein Scott was the only one of the brothers to have completed high school, stating that he attended college in \"Talladega\" and studied business administration. His lawyer, Julie Tizzard, said Akein Scott had been enrolled in college when he was arrested in 2014.\n\nStay with NOLA.com for more on this developing story.", "publish_date": "2015-09-10"}, {"text": "DETROIT (WWJ) – Four people were wounded and a 60-year-old woman was killed Wednesday after a quiet Detroit neighborhood erupted in gunfire.\n\nThe shooting happened around 8 p.m. a home on the 9000 block of Carlin, near Schaefer and West Chicago, on the city’s west side.\n\nSgt. Eren Stephens said a group of children were playing outside when an adult sent one of the youngsters home. That young person apparently went home and told a family member, Stephens said, and a 24-year-old returned with a gun a short time later and began shooting.\n\nA total of five people were shot, including a 15-year old girl, a 24-year-old woman, a 32-year-old woman and a 58-year-old man. They were listed in temporary serious condition at a local hospital. A 60-year-old woman died on the scene. Stephens said those involved in the shooting all knew each other.\n\nPolice are now searching for the gunman, who fled the scene after the shooting.\n\nAnyone with information is asked to call Detroit police at 313-596-2260 or Crime Stoppers at 1-800-SPEAK-UP.", "publish_date": "2013-05-16"}, {"text": "", "publish_date": "2013-02-14"}, {"text": "A 27-year-old Macon man was indicted Tuesday on three counts of aggravated assault in the Jan. 12 shooting of three men inside a house in the 2700 block of Roy Street.\n\nAdrian Maurice Fletcher, of Houston Avenue, also is charged with a violation of the street gang terrorism and prevention act and possession of a firearm by a first offender probationer, according to the indictment filed in Bibb County Superior Court.\n\nAuthorities allege Fletcher is associated with the Crips street gang, according to the indictment.\n\nFletcher and another man were indicted last year in the February 2013 shooting of six men and two women at a house on Mercer University Drive. That case is still pending, according to court records.\n\nUnlimited Digital Access: Only $0.99 For Your First Month Get full access to The Telegraph content across all your devices. SAVE NOW #ReadLocal\n\nFletcher is being held at the county jail without bond, according to jail records.\n\nInformation from Telegraph archives was used in this report. To contact writer Amy Leigh Womack, call 744-4398.", "publish_date": ""}, {"text": "Albert Hernandez Sun-Star photo\n\nAfter deliberating nearly three days, a Merced County jury on Friday convicted a Los Banos gang member of murder in connection with the death of an 18-year-old man last year.\n\nAlbert Hernandez, 18, was found guilty of second-degree murder and criminal street gang participation. The Merced County District Attorney’s Office had charged Hernandez with first-degree, or premeditated, murder.\n\nThe jury of nine women and three men also found Hernandez guilty of firearm and weapons enhancements, but not guilty of three counts of attempted murder in connection with the same incident\n\nThe verdict came after a nearly three-week trial before Judge Ronald W. Hansen in Merced Superior Court.\n\nUnlimited Digital Access: Only $0.99 For Your First Month Get full access to Merced Sun-Star content across all your devices. SAVE NOW #ReadLocal\n\nShane Moore, 18, was shot to death March 4, 2013, at a home in the 800 block of La Mesa Lane in Los Banos. Three other people were injured in the attack.\n\nProsecutors said Hernandez fired 10 rounds from a Ruger P89 pistol with an extended magazine into a crowd of about a dozen people. The group included several people Hernandez believed were rival gang members. Moore was not a gang member and, police said, not the intended target.\n\nThomas Min, the deputy district attorney who prosecuted the case, said he respected the jury’s verdict, saying, “I’m glad that Shane’s family will have some closure.”\n\nMoore’s family attended nearly every day of the trial, but asked for privacy.\n\nCo-defendant Christopher Aguayo pleaded guilty Oct. 2, 2013, to being an accessory in the killing and was sentenced to seven years in the state Division of Juvenile Justice. Aguayo, 16, was charged as an adult.\n\nHernandez’s attorney, Deputy Public Defender Chris Loethen, said that based on the conviction, the jury believed the defendant fired into a crowd of people, but did not intend to kill anyone.\n\n“But firing into a crowd is such an incredibly dangerous action that is likely to produce death or great bodily injury. That’s what this (verdict) indicates,” Loethen said after the verdict was read. “I’m thankful for the not guilty verdicts and the time and the effort and thought they (the jurors) put into this verdict.”\n\nJurors could not be reached for comment Friday.\n\nLoethen said an appeal is planned, and he intends to speak with Hernandez regarding a possible motion for a new trial.\n\nHansen ordered Hernandez to return to court March 28 for sentencing. The maximum possible prison sentence was not clear Friday.\n\nDuring the trial both attorneys focused heavily on Hernandez’s interview with Los Banos police detectives nearly three weeks after Moore’s death. With no physical evidence in the case, Hernandez’s statement was the key piece of evidence.\n\nProsecutors said Hernandez confessed to killing Moore unintentionally while firing at suspected rival gang members.\n\nThe defense called it a false confession and said Hernandez, who was 17 at the time but charged as an adult, only said he killed Moore because police convinced him it was the only way he would be able to see his family again. Prosecutors countered, saying falsely confessing to a murder made “no sense.”\n\nHernandez remains in custody in Merced County pending sentencing.", "publish_date": ""}, {"text": "OLIVEHURST (CBS13) – One person is dead and three others hurt after someone fired several shots at a home in Yuba County Sunday night where a family gathering was underway, according to the Sheriff’s Department.\n\nDeputies got a call several calls reporting shots fired in the area of Poplar Avenue near Almond Avenue at about 10:00 p.m. Sunday.\n\nOfficers arrived to learn that someone in a dark-colored car had fire several shots fired at a home in the 5800 block of Poplar Avenue.\n\nFour people at the home were struck by bullets. Deputies say 20-year-old Teng Yang was pronounced dead at the home. Three others, ranging in age from 19 to 27, were taken to area hospitals with what is believed to be non life-threatening injuries.\n\nDeputies are still searching for a motive in the shooting and they have not ruled out gang involvement.", "publish_date": "2013-02-04"}, {"text": "\n\nhome : news : greenwood April 15, 2019\n\n\n\n\n\n\n\n\n\n\n\n\n\n4/7/2013 1:53:00 AM\n\nOne dead, four others wounded in shooting\n\n+ click to enlarge Thanks for reading GwdToday - Everyday!\n\n\n\n\n\nA 15-year-old boy was shot and killed and four other people were wounded following a shooting Saturday night at some apartments on Tabor Street. According to Lt. Jeff Crisp with the Greenwood Police Department, a large crowd of people were gathered for a birthday party at one of the apartments. City police officers were outside the Greenwood County Detention Center when they heard gunshots just before 10 p.m. They came upon a victim saying he had been shot when approaching the scene. Crisp said that an unknown number of gunmen approached the party and opened fire. A total of five people were shot. Greenwood County Coroner said that a 15-year-old boy was killed as a result of the shooting. City police, including Chief Gerald Brooks, and deputies from the Greenwood County Sheriff’s Office responded to the scene. The investigation into the incident is ongoing.\n\n\n\nRelated Stories: \u0095 Activist says GPD \"fumbled\" homicide investigation \u0095 Suspect in Tabor Street shooting released \u0095 Second arrest made in Tabor Street slaying\n\n\n\n\n\nReader Comments\n\nPosted: Monday, April 15, 2013\n\nArticle comment by: Craig Burd\n\n\n\nGangs in Greenwood are springing up everywhere to battle over turf where no one wants to live. It is awful that young people join gangs and think that they are doing something. Get a real job. Work for a living! Do the things the right way the way our forefathers set this country up. It pisses me off that we have N.Korea threatening our country and we are worried about protecting our territory from lowly, uneducated thugs who actually think people are scared of them because they wear a certain color. Territory and apartments that I wouldn't let my dog live in by the way. Arrest all of these thugs and then get the parents for being negligent and not properly raising their kids.\n\n\n\nPosted: Friday, April 12, 2013\n\nArticle comment by: C. Kirk\n\n\n\nIts funny how everyone wants to blame everyone except the people actually involved. These shootings that have been happening are all gang related. If you're a parent of one of these delinquents then you should know whether or not your child is in a gang. And if you dont then you're not doing your job. If they're living in your house which most of them probably are, then there should be no privacy. if you find guns, drugs or colors in their room then you need to act. if not, you're just as guilty when they pull the trigger or get shot because they were wearing the wrong color or the drug deal goes south. And to all the people that know who is in a gang and dont report them, youre just as guilty. Gangs breed violence and crime. Nothing good comes of them and if you're in one then you're an idiot. If you want power and respect and a sense of pride, join the military, learn a trade. And if you really want to shoot someone then go infantry or marines. Law enforcement cant do it on their own. Ignorance, Fear and silence have a strangle hold on this community and it will ultimately rip us apart.\n\n\n\nPosted: Tuesday, April 9, 2013\n\nArticle comment by: Crystal Hawkins\n\n\n\nFirst, I would like to say SORRY to families that have lost a loved on to this foolishness. I am a single parent of two teenagers (boy and girl). I try my very best to instill positive values that were taught to me by my grandparents, parents and numerous others. But, society today as a whole, has changed altogether. Yes, we say that we need role models and more people getting involved with the lives of theses children and I totally agree. Now, you have some parents that try to be their child's friend rather than raise them. I do believe that there should be a bond between you and your children, but define your boundaries. Don't uphold your children in their wrong doings, chastise them. Make it a priority to read and understand the Bible (ex. GOING TO CHURCH), have a family sit down meal, doing family outings, and pray together. Provide positive results is all that I am saying. Do not let them raise you!!!!! I remember when I was younger, if I even looked like I wanted to step out of line with my parents or grandparents, I would get dealt with then (and it was not a time out or punishment). Now, some of these parents do not want you to say anything to their children. If you do, then you are wrong. So, in my opinion only, this is what the result will be. Without GOD in our lives daily, we will never make it in this world. And again I say that this is just my OPINION....\n\n\n\nPosted: Monday, April 8, 2013\n\nArticle comment by: Mack Galphin\n\n\n\nPoverty + Drugs = Gangs\n\n\n\nIf you trace all of this back to it's roots you will be researching 2 things........the Viet Nam War and the free trade agreements. This is a very complex situation and the first steps to fixing it is do away with these free trade agreements and get a nationwide drug addiction program in place........legalizing pot will help tremendously too.....believe it or not........\n\n\n\nPosted: Monday, April 8, 2013\n\nArticle comment by: LaToya J\n\n\n\nyou do not know what a \"street war\" is...You are in Greenwood. If some of these so called thugs were in real gang infested areas none of you would make it...A 90s baby? Please go and get yourself an education because you are obviously lacking any type of intelligence...\n\n\n\n- Page 1 - Page 2\n\n\n\n\n\nArticle Comment Submission Form Please feel free to submit your comments.\n\n\n\nArticle comments are not posted immediately to the Web site. Each submission must be approved by the Web site editor, who may edit content for appropriateness. There may be a delay of 24-48 hours for any submission while the web site editor reviews and approves it.\n\n\n\nNote: All information on this form is required. Your telephone number is for our use only, and will not be attached to your comment. Submit an Article Comment First Name:\n\nRequired Last Name:\n\nRequired Telephone:\n\nRequired Email:\n\nRequired Comment:\n\nRequired Passcode:\n\nRequired Click here to see a new mix of characters. This is an anti-SPAM device. It is not case sensitive.\n\n\n\n", "publish_date": ""}, {"text": "Tap here to turn on desktop notifications to get the news sent straight to you.", "publish_date": "2013-04-19"}, {"text": "New Roosevelt Bar shooting Feb. 22, 2013 5 Gallery: New Roosevelt Bar shooting Feb. 22, 2013\n\nGRAND RAPIDS, MI -- Police at a hearing this week will try to make a case that recent violence at New Roosevelt Bar stems from poor management.\n\nThe Grand Rapids City Commission at 1 p.m. Tuesday, March 12, will be asked to recommend non-renewal of the Class C liquor license for the bar where a man was killed last year and where four people were shot last month. The recommendation would go to the Michigan Liquor Control Commission.\n\n“After the most recent shooting, the community really stepped up what their concerns were,” said Lt. Richard Nawrocki, who commands the police departments vice unit. “Based upon the immediate community’s concerns, we believe it fits the criteria for the City Commission’s review for non-renewal.\n\n“We’re going to have to prove that the activities have some correlation to the bar here, and that’s what we will try to show.”\n\nRELATED: Grand Rapids police want to revoke liquor license for New Roosevelt Bar, where 4 were shot last month\n\nPolice say they have had to respond to incidents at 1447 Grandville Ave. SW more often since the bar got its liquor license in March 2012. The license should not be renewed because the bar has disturbed peace and order in the neighborhood and housed illegal drugs, according to a city memo.\n\nThe memo shows that many incidents involving police response occurred outside the bar. Bar owner Rosalia Rivera said through an interpreter that closing the bar will not end violence in the neighborhood.\n\n“We can’t be responsible for what happens outside, even if it’s the parking lot,” she said. “It’s unfair because the city is after us, but not after the real criminals. We want crime to stop in the Southwest Side, and I hope that once we close the violence will stop, but they haven’t arrested people in connection to any of the shootings.\n\n\"They are cutting the tree, but not the root (of the problem).\"\n\n\n\nRELATED: Closing New Roosevelt Bar won't eliminate police calls to the area\n\nJulie Niemchick, director of the Roosevelt Park Neighborhood Association, said she sympathizes with Rivera. Still, the neighborhood is tired of the violence and wants the bar to close, she said.\n\n“We can’t keep affording to have someone injured or murdered in our neighborhood,” Niemchick said. “We just can’t have that. We can’t tolerate it.\n\n“It’s the element that keeps showing up at their door that is the problem. If the bar isn’t open, then obviously there won’t be any violence there.”\n\nMLive reporter Sandra Chang contributed to this report.\n\nEmail Matt Vande Bunte, follow him on Twitter or be his friend on Facebook.", "publish_date": "2013-03-10"}, {"text": "Three Merced County youths have been arrested in connection with a suspected gang-related shooting last year at a house party near Atwater that left three teenagers dead, the Merced County Sheriff’s Department confirmed.\n\nGunfire erupted March 30, 2013, during an Easter holiday party in the area of the 9200 block of Westside Boulevard. Three people – Samantha Parreira, 16; Bernabed Hernandez-Canela, 18; and Matthew Fisher, 19 – were fatally shot and two other young people were injured. “Three young people were killed that night, and hopefully this will bring a little bit of closure, but we will never forget, ever forget,” said Desiree Parreira, Samantha’s mother.\n\nFamilies of the other victims could not be reached Thursday for comment.\n\nJose L. Botello and Jose M. Carballido, both 19-year-old Atwater residents, and Jacob Tellez, 18, of Merced, were arrested by detectives with the sheriff’s Major Crimes Unit this week on suspicion of murder and gang participation, Detective-Sgt. Chuck Hale said at a Thursday news conference.\n\nUnlimited Digital Access: Only $0.99 For Your First Month Get full access to The Sacramento Bee content across all your devices. SAVE NOW #ReadLocal\n\nAll three suspects remained behind bars Thursday without bail.\n\nTellez was arrested early Thursday in San Jose. He was still going through the booking process Thursday afternoon and a mugshot was not immediately available. Botello and Carballido were arrested late Wednesday in Atwater. Both Atwater residents belong to the same criminal street gang, and Tellez is a member of another gang, Hale said.\n\nDetectives have not ruled out the possibility of making additional arrests. Deputies said the party started as a holiday gathering for high school students that escalated when word of the gathering spread through social media and text messages, attracting more than 100 people, including members of several Merced County street gangs.\n\nHale declined to comment on the specific incidents at the party that sparked the gun violence, saying releasing certain details, including the number of shooters or whether any murder weapons have been recovered, could harm the investigation. Cooperation from the public and witnesses was a critical factor in making the arrests, Hale said, although he stressed the need for additional help. “There are other people out there that have more information about this party and we invite them to come forward,” Hale said.\n\nDesiree Parreira pleaded for anyone with knowledge of the incident to reach out to sheriff’s investigators. “Don’t be scared,” she said Thursday. “If we keep running around being scared, these gangs are just going to take over and they’re going to take everybody away from us.”\n\nShe described her daughter as a “charismatic, go-getting” young lady who was close to her siblings. The family on Monday celebrated what would have been Samantha’s 18th birthday. She would have graduated from high school earlier this year. “We don’t get to share those things with her anymore. I don’t get to have that anymore and it’s not fair,” she said.“When she was taken from me, it just hardened my heart to know there’s people out there who’d take her away from us.”\n\nParreira’s aunt, Charlotte Alves, said she was “overjoyed” with news of the arrests. “My Sammie was such a good girl. Her smile could light up any room,” Alves said. “She had so much life, so many dreams that will never be accomplished now. This means so much.”\n\nSheriff Tom Cavallero praised the work of the detectives and deputies “who collaborated so well in this effort and were absolutely driven to bring about a resolution.”\n\nDesiree Parreira said the arrests sparked a range of emotions and hadn’t really “sunk in” yet. She said all the families want justice for their loved ones. “My daughter was 16 years old, and I’m never going to see her again because of these people,” she said. “I’ve learned to forgive, but I’ll never forget.”", "publish_date": ""}, {"text": "...\n\nLieutenant (must already be certified as Peace Officer under GA POST) Job Description Job duties include, but are not limited to: responding to major incidents and crimes; trains subordinate personnel in acceptable police practices, methods, techniques, and procedures; advises subordinate personnel on unusual, complex, or difficult situations. Reviews all documents completed by subordinates. Supervises and evaluates assigned personnel. Coordinates activities with other divisions and law enforcement agencies; assists other law enforcement agencies as requested.Will serve as a Community Liaison. Performs uniform patrol and investigative duties as required. Knowledge Requirements: Knowledge of city geography and boundaries; trends in criminal activity. Skill in interviewing and interrogation techniques. Skill in oral and written communications. Minimum Qualifications: Successful candidates must be able to pass a pre-employment drug screen, background check, polygraph test and psychological evaluation. Applicant must be Georgia Post certified and have valid driver’s license. a. Applicants must be at least 21 years of age and possess a Bachelor’s degree in a course of study related to occupational field or an experience level that sufficiently demonstrated competency as determined by the Chief of Police. b. Normally an officer must possess a minimum of three to five years police experience before qualifying for this position. The Chief of Police may exempt certain personnel from the above time requirement under certain circumstances (e.g. - specialized skills, knowledge, education, and/or experience possessed by individuals). c. The Chief of Police, or his designee, may select assessment techniques he feels most appropriate to judge the candidates. These may include interviews, practical exercises, written tests, etc. d. Level of performance as determined by the review of performance evaluations, discipline records, candidate’s daily activity records and other material deemed appropriate. All applicants must submit an application, letter of intent, as well as, a resume beginning Friday, February 1st – Friday, February 22nd, 2019. All applications will remain active for six months. Applications can be found on our website www.cityofwestpointga.com or picked up at City Hall 730 1st Avenue. Deadline for applying is Friday, February 22nd, 2019 @ 5:00 p.m. and should be returned to the Human Resource Department. Virginia Nieves City of West Point Human Resources Department 730 1st Avenue P O Box 487 West Point, GA 31833 Virginia.nieves@cityofwestpointga.com Absolutely NO phone calls please.", "publish_date": ""}, {"text": "Tap here to turn on desktop notifications to get the news sent straight to you.", "publish_date": "2013-01-27"}, {"text": "The sun sets over West Somerset Avenue Tuesday night, as neighbors gather around the scene of a shooting in which one woman was killed and three men were wounded just before 6 p.m. in the Kensington section of Philadelphia. Photographs for the Gun Crisis Reporting Project by Joseph Kaczmarek.\n\nOne man and one women were killed, and six more men were wounded in five separate shooting incidents across Philadelphia in the span of about six hours Tuesday.\n\nA gunman opened fire at Somerset and Lee Streets, where neighbors said a large crowd had been enjoying the warmest day of 2013 before the gun violence broke out.\n\nA 21 year-old woman was shot twice in the chest and taken in a private auto to Episcopal Hospital, where she was pronounced dead shortly after 6 p.m., according to Philadelphia Police Chief Inspector Scott Small.\n\nThe wounded men, ages 18, 21 and 35, were reported in stable condition at Temple University Hospital. According to philly.com, each had suffered multiple gunshot wounds to their legs and abdomen.\n\nInvestigators told NBC10 there were hundreds of people outside when the Kensington shooting occurred. Police said several fights had broken out earlier, according to an Associated Press report.\n\nPolice are looking through surveillance video, according to NBC10, and searching for one shooter and possible accomplices. They described the shooter as a man with a light complexion, about 5 feet 4 inches tall, and wearing a dark tee shirt and jeans, according to philly.com. He was last seen running west on Somerset, and police were unsure which, if any, of the victims was the target.\n\nOfficials told NBC10 that at least seven shots were fired, based on ballistic evidence at the scene. Officials have not released the names of the victims, according to philly.com, and told 6ABC that there is no word on motives.\n\nPhilly.com is now identifying the murdered woman as Amanda Martinez, 20, of Luray Street near Front Street in the Feltonville section of the city.\n\n\n\n(View Philadelphia gun violence outbreak, 04.09.13 in a larger map.)\n\nAbout an hour after the multiple shooting, a 30-year-old man was shot in the head on the 100 block of West Raymond Street in Feltonville. He was also reported stable at Temple.\n\nShortly before 8 p.m., a 47-year-old man was shot in the leg in the area of Girard Avenue and North Taney Street, in the Fairmount section of the city. According to a CBS3 report, he was reported in stable condition with a thigh wound at Hahnemann University Hospital.\n\nAnother man was pronounced dead at the Hospital of the University of Pennsylvania after he was shot three times in the chest at 54th and Chestnut Streets in West Philadelphia at about 11 p.m. According to philly.com, the 18-year-old victim was riding his bicycle when he was shot.\n\nJust before midnight, another 18-year-old man was shot twice in the face on the 600 block of North 34th Street in the Mantua section of the city. According to CBS3, police say the victim remains in very critical condition and was paralyzed from the neck down.\n\nNo one has been arrested in connection with the five shooting incidents that impacted five different sections of the city last night, according to NBC10.\n\nThree people were killed and eight more were wounded — three critically — in 11 shooting incidents reported across Philadelphia last weekend.\n\nPlease share your ideas to stop the shooting with our community by using the #phillypeaceplan hash tag when communicating on social media: http://guncrisis.org/phillypeaceplan/\n\nIf you want to get involved in gun violence reduction in Philadelphia, please consider volunteering with or donating to one of the organizations under our Network tab. If you would like us to add your group to our list, please email us at info@guncrisis.org.\n\nSlideshow: More photos from the scene\n\n[slideshow_deploy id=’10361′]\n\nThe Gun Crisis Reporting Project is an award-winning, independent, nonprofit journalism community striving to illuminate the epidemic of homicide by gunfire in Philadelphia — and find solutions.\n\nBut we need your help. Click to see how your tax-deductible contribution can help our volunteer staff.", "publish_date": "2013-04-10"}, {"text": "SHARE\n\nQuadruple shooting under investigation\n\nMilwaukee police are investigating a quadruple shooting in the 4100 block of N. Teutonia Ave., police said Saturday.\n\nThe four victims have been hospitalized for non-life threatening injuries, Capt. Donald Gaglione said. The motive for the shooting is under investigation, he said.\n\nThe incident happened overnight Friday into Saturday. A news release from Milwaukee police did not indicate a specific time of the shooting.\n\nLake Superior water level jumps in May\n\nA new report says the level of Lake Superior has made a big jump.\n\nThe International Lake Superior Board of Control reported Friday that the level of Lake Superior jumped 9 inches in May. That's more than twice the normal monthly increase and the second most for any month since 1918.\n\nLake Superior usually rises only about 4 inches each May. But thanks to late snow and a cold spring that held back runoff, May more than made up for the difference.\n\nThe lake now sits just 7 inches below its long-term average for June 1. It is a full 3 inches above the level at this time last year.\n\nThe Duluth News Tribune reports Lakes Huron and Michigan also continued their rise from near-record lows in late winter.\n\nDeath of toddler probed in West Allis\n\nWest Allis police late Saturday were investigating the death of a 21-month-old child.\n\nPolice were called to a mobile home in the 10300 block of W. Greenfield Ave. at 4:15 p.m. for an unresponsive child.\n\nAttempts to resuscitate the child were unsuccessful.\n\nPolice and the Milwaukee County medical examiner's office are investigating.\n\nNo other details were provided.\n\nPolice arrest man for making threat\n\nA 39-year-old man accused of making a threat to a Greenfield resident was taken into custody Saturday by Oak Creek police.\n\nThe alleged threat was made about 10 a.m. Police said the man ran into a residence in the 2100 block of W. College Ave. and refused to comply with orders from Oak Creek police officers.\n\nAfter contacting the man on the phone, officers persuaded him to come out of the house.\n\nHe was taken into custody and will be medically evaluated, police said.\n\nThe Milwaukee County district attorney's office will review the case to determine if charges are warranted.\n\nFree swim lessons offered at Wilson Park\n\nThe Milwaukee County Park System and the Southwest Aquatic Team's Swim America Program are offering free Milwaukee County pool open swim summer passes for the first 200 swimmers who register for lessons at the Wilson Park Pool, near W. Howard Ave. and S. 25th St. in Milwaukee.\n\nThose who sign up will also get a free swimming cap and a free pair of goggles.\n\nDale Schrank, the program's director, said he hopes the lessons at Wilson Park Pool will encourage minority youths to learn swimming, as African-Americans and Hispanics are disproportionately represented in drowning deaths. He said Swim America would like to offer lessons at more locations attracting minorities.\n\nParents who would like to register their children can send checks to SWAT Swim America, P.O. Box 138, Muskego, WI 53150. Alternatively, they can register in person on June 4 or June 6 at the Wilson Park and Recreation Center from 5:30 to 7:00 p.m. For more information on the lessons, email swatt@execpc.com or call (262) 971-1658.\n\nIllinois firm to provide cream puff ingredient\n\nWisconsin State Fair-goers may be surprised to learn the main ingredient in a favorite fair treat no longer comes from the dairy state.\n\nThe Wisconsin Bakers' Association has turned to an Illinois company to provide the cream that makes the fair's cream puffs so popular. Prairie Farms Dairy of Carlinville, Ill., won a contract to supply the cream after Golden Guernsey went out of business in Wisconsin.\n\nThe Bakers' Association found no Wisconsin company could handle the daily demand of 1,200 gallons of cream.\n\nState Fair spokeswoman Kristi Chuckel told WISN-TV that Prairie Farms has pledged to work with Wisconsin dairy farms to supply the cream. But, for fairgoer Jeff Fink, it just leaves a bad taste in his mouth.\n\nFink equates it to the Packers moving to Illinois. He says \"there's something just not right about it.\"\n\nTraffic stop reveals heroin, drugs in car\n\nA Milwaukee woman faces felony drug charges after her car was stopped for a traffic violation in Racine County, where police say they found marijuana, pills and about $4,500 worth of heroin in her car.\n\nThe 27-year-old woman — who was a passenger in her vehicle, being driven by someone else — was not identified in a news release from Racine County Sheriff's Office. She is being held in the Racine County jail on charges of possession of marijuana, possession of a controlled substance and possession of heroin with intent to deliver.\n\nAccording to the release, a deputy stopped the car on northbound I-94 early Saturday for an unspecified traffic violation. The deputy smelled burned marijuana, searched the vehicle and found the drugs.\n\nThe driver was not charged and was released.\n\nDeSoto campsites closed temporarily\n\nDeSoto — A southwestern Wisconsin park is offering only limited camping this weekend due to minor flooding.\n\nThe U.S. Army Corps of Engineers said Blackhawk Park near DeSoto has extremely wet conditions.\n\nIn addition, the Corps will close sites 40 to 73 of the West Loop Camping Area Monday through Thursday to do maintenance work.\n\nThe Corps said with the flooding and this closure, the number of campsites at Blackhawk Park will be limited. Campers should contact park staff before planning a camping trip.\n\nThe Corps plans to reopen the West Loop for next weekend and other sites as river levels recede and conditions improve.\n\nJournal Sentinel staff and wires", "publish_date": ""}, {"text": "The first year of a divided Congress got off to an inauspicious start on the federal budget, as the House and Senate both failed to approve a budget framework for 2020 before going home for a two week Easter break, continuing a less than stellar bipartisan record of action on spending and deficits on Capitol Hill in recent years. 'Last year was a historically bad year for the Congressional budget process,' said the Committee for a Responsible Federal Budget, noting it was the first time since 1976 that neither the House nor the Senate voted on a budget resolution. 'Unfortunately, this only adds to a poor budget record,' the group added. One important point before we get too deep into Legislative Nerd Territory - the term 'budget' does not relate to actual spending, but rather to what's known as the 'budget resolution,' which is a budget outline - a framework - for what Congress will do later in the year, filling in the blanks with the specifics of spending choices. As the CFRB notes, this year is not getting off to a good start on the budget, which is even more troublesome given the divided nature of Congress, with Democrats in charge of the House, and Republicans leading the Senate. And the forecast is for a difficult budget year - which many believe might end up in another government shutdown in October, and a possible across-the-board sequester soon after. Here's just some of what gone on, and what to look for on Capitol Hill. 1. Divided House Democrats punt on 2020 budget. Just like Republicans in the House struggled for years to balance the interests of more conservative members of the Freedom Caucus and more moderate GOP lawmakers, Democrats have the same balancing act. More liberal members want to do big things in the budget. More moderate 'Blue Dog' Democrats want a more middle ground on spending. And so, Democrats had to give up plans last week to vote on a bill to raise the caps on federal spending for the next two years by nearly $350 billion. Progressives didn't like it because it spent too much on defense, at $733 billion. Meanwhile, some more moderate Democrats were talking about a balanced budget amendment to the Constitution. The internal Democratic Party dustup was music to ears of Republicans, who chortled about the Democrats running into the Legislative Ditch. 2. Senate Republicans didn't vote on their budget outline either. While Republicans chuckled at the failure of Democrats to force a vote on their budget plan for 2020, GOP Senators didn't even try to act on their budget resolution before the April 15 deadline. The Senate GOP budget resolution would reduce future planned spending increases by over a half billion dollars, but it wouldn't come close to the defense spending levels backed by President Trump - who wants $750 billion for defense. House Democrats have proposed $733 billion, while the Senate Republican budget would have funding for the military set at $643 billion, well below the President's request. And so, for a second straight year, there was no budget vote-a-rama in the Senate on the non-binding budget resolution. 3. The Defense Budget Gimmick used by both parties. With budget caps in place that limit how much you can spend on the military and non-defense items in the budget, Congress is still doing its best to get around those limits, especially for the military, by using an extra fund known as OCO - which stands for Overseas Contingency Operations. For example, President Trump's 2020 budget would put $174 billion in the OCO fund - more money than almost all other federal agencies - in order to get to a $750 billion budget for the Pentagon. Democrats have $69 billion in OCO, with Senate Republicans at $67 billion. If there's no deal on raising the budget caps, then the most money which could be spent on the Pentagon is $576 billion - unless, you get around that with the OCO $174 billion. 'OCO would be the 2nd largest federal agency, if it was an agency,' grumbled the group Taxpayers for Common Sense, as many say it's nothing but a slush fund. 4. McConnell, Pelosi want to negotiate a new budget deal. Even as Democrats were running aground on their effort to pass a bill which increases the spending caps, Senate Majority Leader Mitch McConnell agreed with Speaker of the House Nancy Pelosi to start talks on a budget agreement, as both parties know full well they need to get going now in order to have any chance of an across-the-board budget cut known as the sequester. If you look at graphic just above this bullet point, you will see the figure of $576 billion for the Pentagon, and $542 billion for non-defense spending - those are the 'spending caps' set in law by a 2011 bipartisan budget deal. Current funding is much more than that, at $716 billion for the Pentagon and $605 billion for non-defense spending. The last three deals on the budget caps have raised the amount of spending each time - and the President may not go for that this time around. 5. Looming over all of this is a sequester. The reason lawmakers want to reach a 'spending caps' agreement is that the Budget Act of 2011 is still on the books, and if there is no agreement on the amount of money to spend in 2020, then an across-the-board budget cut known as the 'sequester' will kick in. And that would be a very big deal. If a sequester hits, the military budget would technically have go down from $716 billion to $576 billion - a cut of $140 billion. If the sequester kicks in, domestic spending would be trimmed from $605 billion to $542 billion. Ironically, because of the big increase that the GOP Congress was able to give to the Pentagon in 2017 and 2018, a sequester would hurt the military more than non-defense spending in 2020 and beyond. This is where the OCO funding (look above) comes into play - President Trump could allow the sequester to kick in, but still funnel more money to the Pentagon through that extra fund. One problem with that game plan is the GOP probably would not have 60 votes in the Senate to get that done. This may get pretty messy in the months ahead.", "publish_date": "2013-02-22"}, {"text": "Authorities were asking for the public’s help in identifying suspects involved in the shooting and wounding of four men outside a Lancaster concert venue early Saturday.\n\nThe incident occurred about 2 a.m. after an altercation among patrons of Industry Theater in the 43000 block of Business Center Parkway spilled into the parking lot and gunfire erupted, according to Lt. Vince Carter of the Los Angeles County Sheriff's Department.\n\n“Four innocent patrons not involved in the altercation were hit,” Carter said. The victims -- age 22, 26, 29 and 37 -- were taken to a local hospital where they remain in “stable condition,” he said. They were not identified.\n\nThe suspects remain at large, authorities said, and no further details were available, authorities said.\n\nALSO:\n\nSanta Ana hoping for big returns in first-ever gun buyback\n\nWhittier police hunt for girl believed to have escaped kidnapper\n\nMarine corporal accused of murder in Army Reserve officer's death\n\n-- Ann M. Simmons", "publish_date": ""}, {"text": "", "publish_date": "2013-01-17"}, {"text": "\"You could see the guns just spraying from the window. Everybody ran to the back room. And I said that they're shooting, they're shooting somebody. I didn't know anybody got shot until we came outside and I saw somebody lying on the ground,\" said resident Carlos Greer describing the gunfire.", "publish_date": ""}, {"text": "Three people were shot to death, and a was fourth wounded, in a dispute that may have been over drugs at a Harbor Gateway apartment complex, officials said.\n\nPolice said the incident appeared to be isolated.\n\n\"There is no additional danger to the community members in the area,\" LAPD Capt. Nancy Lauer told reporters Friday.\n\nPolice received a 911 call about 5:35 a.m. from a resident who reported hearing eight or nine gunshots in an apartment building in the 1600 block of West 205th Street. When officers arrived, they found three victims.\n\nAbout a block away, police found a fourth shooting victim, covered in blood, walking near Del Amo Boulevard and Western Avenue, said Officer Christopher No. That person was listed in serious condition at a hospital, Lauer said.\n\nAuthorities said a red Dodge Charger and a gray Ford Explorer were seen speeding from the scene.\n\n\"We have a number of leads,\" Lauer said.\n\nThe attack did not appear to be random, police said.\n\n\"This is not gang-related, this is not race-related,\" Sgt. Rudy Lopez said. \"It appears all the individuals knew each other. It was an argument gone wrong.\"\n\nSeveral blocks were cordoned off by police tape as detectives and officers huddled at the intersection of Harvard Boulevard and West 206th Street on Friday morning. Some photographed the building and nearby sidewalk.\n\nSome neighbors walked over to watch, shaking their heads when asked if they had heard anything earlier.\n\n\"I saw it on the news,\" one man said.\n\nThe neighborhood is a mix of houses and apartment buildings, most surrounded by wrought-iron fences and many with flowers in the frontyards.\n\njoseph.serna@latimes.com\n\nkate.mather@latimes.com\n\nTimes staff writer Andrew Blankstein contributed to this report.", "publish_date": "2013-05-10"}, {"text": "AURORA — Sonny Archuleta was a talented guy, an artist who filled his garage walls with graffiti murals and fashioned molten glass into pipes and bongs, according to neighbors.\n\nBut Archuleta, 33, apparently went over the edge on Saturday, killing three before police shot him to death after he opened fire on them from the townhouse where he lived with his wife, Stephanie Philbrook Archuleta, 30.\n\nPolice have not officially identified the gunman, or his victims, who were found dead in the home after the six-hour standoff ended Saturday morning. But neighbors and other sources say the shooter was Archuleta, and that the victims were his wife”s father, Anthony Ticali, her sister, Stacie Philbrook and Philbrook”s boyfriend.\n\nPhilbrook Archuleta escaped the home by jumping from the second floor window. She didn”t want to talk to media, her mother, Shannon Ticali, said Sunday.\n\n“Stephanie needs to grieve the loss of her sister and dad,” Ticali said.\n\nAfter escaping from the home, Philbrook Archuleta told police her husband was mentally unbalanced, according to a police source. Authorities are investigating the possibility that the gunman was a methamphetamine user.\n\nThe Archuletas rented the townhouse from Stacie Philbrook, and had lived there together for about a year, said Melissa Wright, 33, who lives across an alley from the townhouse in the 16000 block of East Ithaca Place.\n\nThey were an “odd-couple,” said Wright, a registered nurse at the Medical Center of Aurora, who worked at a drug rehabilitation facility in the past. “His eyes were always dilated, he was very loud and running around all the time. I”m a nurse, my job is to assess people and he seemed like he was on drugs.\n\n“She didn”t seem anything like that, she was very reserved. She seemed like a good girl; Stacie, too,” Wright said of Philbrook Archuleta and her sister.\n\nDoug Welch, a neighbor, said he frequently saw Archuleta outside the house working on his motorcycle. Inside the couple”s garage, Welch said, he could see large murals that Archuleta had painted.\n\nWright said Archuleta built the motorcycle himself, and practiced glass blowing. “He was a talented guy.”\n\nThe couple had been married for at least seven years, said a woman who knows the family, but asked that her name not be used because she didn”t want to speak for them.\n\n“Sonny and Stephanie definitely loved each other,” Ticali said. They were married in a civil ceremony by a justice of the peace, but on their second anniversary the couple tied the knot again at a religious ceremony at the Word of Life Christian Center, Ticali said.\n\nPhilbrook Archuleta worked at the Word of Life Academy, a day-care and tutoring center at the church in Lone Tree.\n\n“We need to pray for Stephanie. The loss of her sister, husband and other family member is beyond our understanding,” Senior Pastor Mark Bagwell said at Sunday services.", "publish_date": "2013-01-06"}, {"text": "John Powell Fordham, 76, died peacefully Wednesday, April 10, 2019 at Holly Hill Nursing home in Valdosta, Georgia following a battle with cancer. He was a strong patriarch of his family and a good friend to all that knew him. He leaves behind his wife of 55 years Cecila Dale (Lindsey) Fordh…", "publish_date": ""}]